{
	"class_name": "Sequential",
	"config": [{
		"class_name": "Conv2D",
		"config": {
			"kernel_initializer": {
				"class_name": "VarianceScaling",
				"config": {
					"scale": 1.0,
					"mode": "fan_avg",
					"distribution": "uniform",
					"seed": null
				}
			},
			"bias_initializer": {
				"class_name": "Zeros",
				"config": {}
			},
			"batch_input_shape": [null, 48, 48, 1],
			"data_format": "channels_last",
			"bias_constraint": null,
			"activity_regularizer": null,
			"filters": 64,
			"trainable": true,
			"strides": [1, 1],
			"activation": "linear",
			"kernel_size": [5, 5],
			"kernel_regularizer": null,
			"use_bias": true,
			"padding": "same",
			"dtype": "float32",
			"name": "conv2d_1",
			"kernel_constraint": null,
			"dilation_rate": [1, 1],
			"bias_regularizer": null
		}
	}, {
		"class_name": "Activation",
		"config": {
			"name": "activation_1",
			"trainable": true,
			"activation": "relu"
		}
	}, {
		"class_name": "MaxPooling2D",
		"config": {
			"pool_size": [3, 3],
			"data_format": "channels_last",
			"padding": "valid",
			"name": "max_pooling2d_1",
			"trainable": true,
			"strides": [2, 2]
		}
	}, {
		"class_name": "Conv2D",
		"config": {
			"kernel_initializer": {
				"class_name": "VarianceScaling",
				"config": {
					"scale": 1.0,
					"mode": "fan_avg",
					"distribution": "uniform",
					"seed": null
				}
			},
			"bias_initializer": {
				"class_name": "Zeros",
				"config": {}
			},
			"strides": [1, 1],
			"data_format": "channels_last",
			"bias_constraint": null,
			"activity_regularizer": null,
			"filters": 64,
			"trainable": true,
			"activation": "linear",
			"kernel_size": [5, 5],
			"kernel_regularizer": null,
			"padding": "same",
			"dilation_rate": [1, 1],
			"name": "conv2d_2",
			"kernel_constraint": null,
			"use_bias": true,
			"bias_regularizer": null
		}
	}, {
		"class_name": "Activation",
		"config": {
			"name": "activation_2",
			"trainable": true,
			"activation": "relu"
		}
	}, {
		"class_name": "MaxPooling2D",
		"config": {
			"pool_size": [3, 3],
			"data_format": "channels_last",
			"padding": "valid",
			"name": "max_pooling2d_2",
			"trainable": true,
			"strides": [2, 2]
		}
	}, {
		"class_name": "Conv2D",
		"config": {
			"kernel_initializer": {
				"class_name": "VarianceScaling",
				"config": {
					"scale": 1.0,
					"mode": "fan_avg",
					"distribution": "uniform",
					"seed": null
				}
			},
			"bias_initializer": {
				"class_name": "Zeros",
				"config": {}
			},
			"strides": [1, 1],
			"data_format": "channels_last",
			"bias_constraint": null,
			"activity_regularizer": null,
			"filters": 128,
			"trainable": true,
			"activation": "linear",
			"kernel_size": [4, 4],
			"kernel_regularizer": null,
			"padding": "same",
			"dilation_rate": [1, 1],
			"name": "conv2d_3",
			"kernel_constraint": null,
			"use_bias": true,
			"bias_regularizer": null
		}
	}, {
		"class_name": "Activation",
		"config": {
			"name": "activation_3",
			"trainable": true,
			"activation": "relu"
		}
	}, {
		"class_name": "Dropout",
		"config": {
			"trainable": true,
			"name": "dropout_1",
			"rate": 0.3,
			"noise_shape": null,
			"seed": null
		}
	}, {
		"class_name": "Flatten",
		"config": {
			"name": "flatten_1",
			"trainable": true
		}
	}, {
		"class_name": "Dense",
		"config": {
			"kernel_initializer": {
				"class_name": "VarianceScaling",
				"config": {
					"scale": 1.0,
					"mode": "fan_avg",
					"distribution": "uniform",
					"seed": null
				}
			},
			"bias_initializer": {
				"class_name": "Zeros",
				"config": {}
			},
			"bias_constraint": null,
			"activity_regularizer": null,
			"trainable": true,
			"kernel_regularizer": null,
			"units": 3072,
			"activation": "linear",
			"bias_regularizer": null,
			"name": "dense_1",
			"kernel_constraint": null,
			"use_bias": true
		}
	}, {
		"class_name": "Activation",
		"config": {
			"name": "activation_4",
			"trainable": true,
			"activation": "relu"
		}
	}, {
		"class_name": "Dropout",
		"config": {
			"trainable": true,
			"name": "dropout_2",
			"rate": 0.3,
			"noise_shape": null,
			"seed": null
		}
	}, {
		"class_name": "Dense",
		"config": {
			"kernel_initializer": {
				"class_name": "VarianceScaling",
				"config": {
					"scale": 1.0,
					"mode": "fan_avg",
					"distribution": "uniform",
					"seed": null
				}
			},
			"bias_initializer": {
				"class_name": "Zeros",
				"config": {}
			},
			"bias_constraint": null,
			"activity_regularizer": null,
			"trainable": true,
			"kernel_regularizer": null,
			"units": 7,
			"activation": "linear",
			"bias_regularizer": null,
			"name": "dense_2",
			"kernel_constraint": null,
			"use_bias": true
		}
	}, {
		"class_name": "Activation",
		"config": {
			"name": "activation_5",
			"trainable": true,
			"activation": "softmax"
		}
	}],
	"backend": "tensorflow",
	"keras_version": "2.1.1"
}